adafruit/micropython/ports/stm/peripherals/stm32f1/clocks.c
 /*
 * This file is part of the Micro Python project, http://micropython.org/
 *
 * The MIT License (MIT)
 *
 * Copyright (c) 2020 Lucian Copeland for Adafruit Industries
 *
 * Permission is hereby granted, free of charge, to any person obtaining a copy
 * of this software and associated documentation files (the "Software"), to deal
 * in the Software without restriction, including without limitation the rights
 * to use, copy, modify, merge, publish, distribute, sublicense, and/or sell
 * copies of the Software, and to permit persons to whom the Software is
 * furnished to do so, subject to the following conditions:
 *
 * The above copyright notice and this permission notice shall be included in
 * all copies or substantial portions of the Software.
 *
 * THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
 * IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
 * FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE
 * AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER
 * LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,
 * OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN
 * THE SOFTWARE.
 */

#include "stm32f1xx_hal.h"
#include "supervisor/shared/safe_mode.h"
#include <stdbool.h>

// F1 Series
#ifdef STM32F103xE
#include "stm32f1/stm32f103xe/clocks.h"
#endif


void stm32_peripherals_clocks_init(void) {
    RCC_ClkInitTypeDef clkinitstruct = {0};
    RCC_OscInitTypeDef oscinitstruct = {0};
    RCC_PeriphCLKInitTypeDef rccperiphclkinit = {0};

    /* Enable HSE Oscillator and activate PLL with HSE as source */
    oscinitstruct.OscillatorType  = RCC_OSCILLATORTYPE_HSE;
    oscinitstruct.HSEState        = RCC_HSE_ON;
    oscinitstruct.HSEPredivValue  = RCC_HSE_PREDIV_DIV1;
    oscinitstruct.PLL.PLLMUL      = RCC_PLL_MUL9;
    oscinitstruct.PLL.PLLState    = RCC_PLL_ON;
    oscinitstruct.PLL.PLLSource   = RCC_PLLSOURCE_HSE;
    HAL_RCC_OscConfig(&oscinitstruct);

    /* USB clock selection */
    rccperiphclkinit.PeriphClockSelection = RCC_PERIPHCLK_USB;
    rccperiphclkinit.UsbClockSelection = RCC_USBCLKSOURCE_PLL_DIV1_5;
    HAL_RCCEx_PeriphCLKConfig(&rccperiphclkinit);

    /* Select PLL as system clock source and configure the HCLK, PCLK1 and PCLK2 clocks dividers */
    clkinitstruct.ClockType = (RCC_CLOCKTYPE_SYSCLK | RCC_CLOCKTYPE_HCLK | RCC_CLOCKTYPE_PCLK1 | RCC_CLOCKTYPE_PCLK2);
    clkinitstruct.SYSCLKSource = RCC_SYSCLKSOURCE_PLLCLK;
    clkinitstruct.AHBCLKDivider = RCC_SYSCLK_DIV1;
    clkinitstruct.APB1CLKDivider = RCC_HCLK_DIV2;
    clkinitstruct.APB2CLKDivider = RCC_HCLK_DIV1;
    HAL_RCC_ClockConfig(&clkinitstruct, FLASH_LATENCY_2);
    
    // RCC_ClkInitTypeDef RCC_ClkInitStruct;
    // RCC_OscInitTypeDef RCC_OscInitStruct;
    // RCC_PeriphCLKInitTypeDef PeriphClkInitStruct;

    // // Set voltage scaling in accordance with system clock speed
    // __HAL_RCC_PWR_CLK_ENABLE();
    // //__HAL_PWR_VOLTAGESCALING_CONFIG(CPY_CLK_VSCALE);  F1没有

    // // Set up primary PLL and HSE clocks
    // RCC_OscInitStruct.OscillatorType = RCC_OSCILLATORTYPE_HSE;
    // #if (BOARD_HAS_LOW_SPEED_CRYSTAL)
    // RCC_OscInitStruct.OscillatorType |= RCC_OSCILLATORTYPE_LSE;
    // RCC_OscInitStruct.LSEState = RCC_LSE_ON;
    // #else
    // RCC_OscInitStruct.OscillatorType |= RCC_OSCILLATORTYPE_LSI;
    // RCC_OscInitStruct.LSIState = RCC_LSI_ON;
    // #endif
    // RCC_OscInitStruct.HSEState = RCC_HSE_ON;
    // RCC_OscInitStruct.HSEPredivValue = RCC_HSE_PREDIV_DIV1;  //++++> HSE 一分频
    // RCC_OscInitStruct.PLL.PLLState = RCC_PLL_ON;
    // RCC_OscInitStruct.PLL.PLLSource = RCC_PLLSOURCE_HSE;
    // RCC_OscInitStruct.PLL.PLLMUL = CPY_CLK_MUL;            //++++> HSE X倍频

    // if(HAL_RCC_OscConfig(&RCC_OscInitStruct) != HAL_OK) {
    //     // Clock issues are too problematic to even attempt recovery.
    //     // If you end up here, check whether your LSE settings match your board.
    //     while(1);
    // }

    // // Configure bus clock sources and divisors
    // RCC_ClkInitStruct.ClockType = (RCC_CLOCKTYPE_SYSCLK | RCC_CLOCKTYPE_HCLK | RCC_CLOCKTYPE_PCLK1 | RCC_CLOCKTYPE_PCLK2);
    // RCC_ClkInitStruct.SYSCLKSource = RCC_SYSCLKSOURCE_PLLCLK;
    // RCC_ClkInitStruct.AHBCLKDivider = CPY_CLK_AHBDIV;
    // RCC_ClkInitStruct.APB1CLKDivider = CPY_CLK_APB1DIV;
    // RCC_ClkInitStruct.APB2CLKDivider = CPY_CLK_APB2DIV;
    // HAL_RCC_ClockConfig(&RCC_ClkInitStruct, CPY_CLK_FLASH_LATENCY);

    // // Set up non-bus peripherals
    // // TODO: I2S settings go here
    // PeriphClkInitStruct.PeriphClockSelection = RCC_PERIPHCLK_RTC;
    // #if (BOARD_HAS_LOW_SPEED_CRYSTAL)
    // PeriphClkInitStruct.RTCClockSelection = RCC_RTCCLKSOURCE_LSE;
    // #else
    // PeriphClkInitStruct.RTCClockSelection = RCC_RTCCLKSOURCE_LSI;
    // #endif
    // PeriphClkInitStruct.PeriphClockSelection |= RCC_PERIPHCLK_USB;
    // PeriphClkInitStruct.UsbClockSelection = RCC_USBCLKSOURCE_PLL_DIV1_5;
    // HAL_RCCEx_PeriphCLKConfig(&PeriphClkInitStruct);
}
